app/controllers/experiences_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_user
      begin
        @user = User.find(params[:user_id])