app/controllers/friendships_controller.rb

SELECT users.*, friendships.secret_lover_accepted as has_secret_acces FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = $1 AND (friendships.accepted = 't')  [["user_id", 1]]
---
  def index
    @friendships = @user.friends
    @users = []
    @friendships.each do |friend|
      @users.push(User.find(friend.user_id))

SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 1 AND "friendships"."user_id" = 1 LIMIT 1
---
  def show
    @friendships = Friendship.where(friend_id: params[:friend_id], user_id: params[:user_id]).first

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_user
      begin
        @user = User.find(params[:user_id])