app/controllers/lovers_controller.rb

SELECT "lovers".* FROM "lovers" WHERE "lovers"."lover_id" = 1 AND "lovers"."user_id" = 2 ORDER BY name DESC LIMIT 1
---
  def show
    @rel_lover  = @user.user_lovers.where(lover_id: @lover.lover_id).first

INSERT INTO "lovers" ("age", "created_at", "facebook_id", "height", "job", "lover_id", "name", "photo_url", "sex_gender", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    lovers = JSON.parse(params[:lovers].to_json)
    errors = []
    info = []
    lovers.each do |lov|
      #if @user.lovers.exists?(facebook_id: lov["facebook_id"], name: lov["name"])
      if @user.lovers.exists?(facebook_id: lov["facebook_id"])
        #errors << "Lover with facebook_id: #{lov["facebook_id"]} and name: #{lov["name"]} already exists"
        errors << "Lover with facebook_id: #{lov["facebook_id"]} already exists"

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "2"]]
---
    def set_user
     begin
        @user = User.find(params[:user_id])

SELECT "lovers".* FROM "lovers" WHERE "lovers"."id" = $1 ORDER BY name DESC LIMIT 1  [["id", "1"]]
---
    def set_lover
      begin
        @lover = Lover.find(params[:lover_id])