app/controllers/users_controller.rb

  def destroy
    id = @user.user_id
    Friendship.where(friend_id: id).destroy_all
---
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 50]]