app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @friendship = Friendship.find_by_user_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 1 LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("birthday", "created_at", "email", "eye_color", "facebook_id", "hair_color", "hairdressing", "height", "job", "main_photo_url", "name", "password_digest", "photo_num", "preference1", "preference2", "preference3", "preference4", "preference5", "preference6", "remember_token", "sex_gender", "sex_interest", "startday", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = $1, "remember_token" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["name", "Pepito"], ["remember_token", "bO3Z-yi3eZb-wEzRrgh2pw"], ["updated_at", Thu, 11 Jul 2013 08:00:00 UTC +00:00]]

  def delete
    logger.debug "PARAMS"
    logger.debug params
    @user = User.find(params[:user_id])
    logger.debug @users
    User.find(params[:user_id]).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "9"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]