app/controllers/users_controller.rb

  def destroy
    id = @user.user_id
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]